<?php

/**
 *
 */
class arb
{
  public $val;

  public $langA = array(

    'eCommerce Web'=>'مواقع تجارية',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>''
  );


public function langA($W)
  {
    $run = $this->langA;
    return $run[$W];
  }

}















//
//
//
// /**
//  *
//  */
// class arb
// {
//   public $langA = array(
//
//      'Home' => 'الرئيسية',
//      'الاقسام' => 'Categories',
//     'My Profile' => 'حسابي',
//     'Settings' => 'الإعدادات',
//     'site' => 'View Site',
//     'العناصر' => 'Items',
//     'الاعضاء' => 'Members',
//     'التعليقات' => 'Comments',
//     'STATISTICS' => 'Statistics',
//     'التسجيلات' => 'Logs',
//     'المنشأة' => 'brand',
//     'Brands' => 'المركات',
//     'البحث' => 'Search',
//     'ايجاد قسم' => 'Found Category',
//     'ايجاد براند' => 'Found Brand',
//     'ايجاد عضو' => 'Found Member',
//     'ايجاد اعلان' => 'Found Item',
//     'Special Sffers' => 'عرض خاص',
//     'الاعلانات' => 'Advertises',
//     'Prices And Taxs' => 'الأسعار تشمل ضريبة القيمة المضافة',
//     'Saving' => 'ستوفر',
//     'EGP' => 'جنيه',
//     'Shoes'=>'احذية',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>'',
//     ''=>''
//   );
//
//   function langA($arb)
//   {
//     echo $this-> self::langA[0][$arb];
//   }
// }
//
// //
// // function langA($arb) {
// //     $langF = $langA;
// //     // static $langF;
// //     return $langF[$arb];
// // }
// //
// //  $langA = array(
// //
// //    'Home' => 'الرئيسية',
// //    'الاقسام' => 'Categories',
// //   'My Profile' => 'حسابي',
// //   'Settings' => 'الإعدادات',
// //   'site' => 'View Site',
// //   'العناصر' => 'Items',
// //   'الاعضاء' => 'Members',
// //   'التعليقات' => 'Comments',
// //   'STATISTICS' => 'Statistics',
// //   'التسجيلات' => 'Logs',
// //   'المنشأة' => 'brand',
// //   'Brands' => 'المركات',
// //   'البحث' => 'Search',
// //   'ايجاد قسم' => 'Found Category',
// //   'ايجاد براند' => 'Found Brand',
// //   'ايجاد عضو' => 'Found Member',
// //   'ايجاد اعلان' => 'Found Item',
// //   'Special Sffers' => 'عرض خاص',
// //   'الاعلانات' => 'Advertises',
// //   'Prices And Taxs' => 'الأسعار تشمل ضريبة القيمة المضافة',
// //   'Saving' => 'ستوفر',
// //   'EGP' => 'جنيه',
// //   'Shoes'=>'احذية',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>'',
// //   ''=>''
// // );
// //
//

 ?>
